/*==========================================Copyright(c)===========================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information------------------------------------------
** @File Name    : UserTactic.h
** @Founder      : ZQD808
** @Date         : 2026.03.25
** @Function     : 用户自定义策略模块
** @Instructions : 
**===============================================================================================*/
#ifndef _USERTACTIC_H
#define _USERTACTIC_H

/*=================================================================================================
** @Header file definition
**===============================================================================================*/
#include "BSPTypeDef.h"

/*=================================================================================================
** @Name      : void GroupSysIoUpDnCtrlTask(void)
** @Input     : void
** @Output    : void
** @Function  : 主控系统按钮启停控制任务
** @The notes : 1s周期
**===============================================================================================*/
void GroupSysIoUpDnCtrlTask(void);
/*=================================================================================================
** @Name      : void GroupSysPwrOffProTask(void)
** @Input     : void
** @Output    : void
** @Function  : 主控系统关机下电保护任务
** @The notes : 2s周期
**===============================================================================================*/
void GroupSysPwrOffProTask(void);
/*=================================================================================================
** @Name      : u8 GetButtonStopReqStateAPI(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : 按钮请求停机状态标志:0:未请求 1:请求停机
** @Function  : 获取按钮请求停机状态
** @The notes :
**===============================================================================================*/
u8 GetButtonStopReqStateAPI(u8 clunum);
#endif