/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CalcInterface.c
** @Founder      : ZQD808
** @Date         : 2026.03.05
** @Function     : 计算模块用户接口函数
** @Instructions :
**===========================================================================================*/
#ifndef _CALCINTERFACE_H
#define _CALCINTERFACE_H
#include "BSPTypeDef.h"
#include "PublicInfo.h"
#include "GroupInfo.h"
#include "GroupPara.h"


#define  TEMP_CURRLIMIT_NUM     15      //不同温度充放电倍率表列宽(必须与gEepCfg_105[]长度一致)
#define  SLOW_CURRLIMIT_NUM     10      //平滑充放电电流限值表列宽(必须与gGroupParaRO_119[]长度一致)

#define  TEMP_VOLTLIMIT_NUM     14      //不同温度电压限值表列宽(必须与gEepCfg_110[]长度一致)
/*=================================================================================================
** @Name      : u8 CalcGetGroupCellVExpStateHook(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : 电池组单体电压异常状态: 0:正常 1:异常
** @Function  : 获取电池组单体电压异常状态
** @The notes : 从控电压采样失效/断线/CAN断线时从控单节电压异常
**===============================================================================================*/
u8 CalcGetGroupCellVExpStateHook(u8 clunum);
/*=============================================================================================
** @Name      : u8 CalcGetGroupCellTExpStateHook(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : 电池组单体温度异常状态 0:正常 1:异常
** @Function  : 获取电池组单体温度异常状态
** @The notes : 从控温度计采样失效/断线/CAN断线时从控单节温度异常
**===========================================================================================*/
u8 CalcGetGroupCellTExpStateHook(u8 clunum);
/*=================================================================================================
** @Name      : u8 CalcGetGropuNeedSysLimStateHook(u8 clunum)
** @Input     : void
** @Output    : 充放电需限制状态:0正常 1需限制充放电
** @Function  : 获取电池组充放电需限制状态
** @The notes : 产生充放电限制故障或按下停机按钮
**===============================================================================================*/
u8 CalcGetGropuNeedSysLimStateHook(u8 clunum);
/*=============================================================================================
** @Name      : u8 CalcGetGroupNeedChgLimStateHook(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : 电池组需要充电限制状态: 0正常 1需充电限制
** @Function  : 获取电池组需要充电限制状态
** @The notes : 充满或充电限制
**===========================================================================================*/
u8 CalcGetGroupNeedChgLimStateHook(u8 clunum);
/*=============================================================================================
** @Name      : u8 CalcGetGroupNeedDhgLimStateHook(u8 clunum)
** @Input     : void
** @Output    : 电池组需要放电限制状态: 0正常 1需放电限制
** @Function  : 获取电池组需要放电限制状态
** @The notes : 放空或放电限制
**===========================================================================================*/
u8 CalcGetGroupNeedDhgLimStateHook(u8 clunum);
/*=============================================================================================
** @Name      : u16 CalcGetChgLimMaxSumVHook(void)
** @Input     : void
** @Output    : 电池组总压充电截止最大电压值(单位:0.1V)
** @Function  : 获取电池组总压充电截止最大电压
** @The notes : 总压高压2级限值(充电限制)
**===========================================================================================*/
u16 CalcGetChgLimMaxSumVHook(void);
/*=============================================================================================
** @Name      : u16 CalcGetDhgLimMinSumVHook(void)
** @Input     : void
** @Output    : 电池组总压放电截止最小电压值(单位:0.1V)
** @Function  : 获取电池组总压放电截止最小电压
** @The notes : 总压低压2级限值(放电限制)
**===========================================================================================*/
u16 CalcGetDhgLimMinSumVHook(void);
/*=============================================================================================
** @Name      : u16 CalcGetChgLimCellVoltHook(void)
** @Input     : void
** @Output    : 电池组充电截止单体电压值(单位:1mV)
** @Function  : 获取电池组充电截止单体电压
** @The notes : 单体高压2级限值(充电限制)
**===========================================================================================*/
u16 CalcGetChgLimCellVoltHook(void);
/*=============================================================================================
** @Name      : u16 CalcGetDhgLimCellVoltHook(void)
** @Input     : void
** @Output    : 电池组放电截止单体电压值(单位:1mV)
** @Function  : 获取电池组放电截止单体电压
** @The notes : 单体低压2级限值(放电限制)
**===========================================================================================*/
u16 CalcGetDhgLimCellVoltHook(void);
/*=============================================================================================
** @Name      : s16 CalcGetChgCDnFstHTempHook(void)
** @Input     : void
** @Output    : 充电高温降电流限值的起始温度 1℃
** @Function  : 获取充电高温降电流限值的起始温度
** @The notes : 默认45℃开始限充电电流限值
**===========================================================================================*/
s16 CalcGetChgCDnFstHTempHook(void);
/*=============================================================================================
** @Name      : s16 CalcGetChgCDnLstHTempHook(void)
** @Input     : void
** @Output    : 充电高温降电流限值结束温度 1℃
** @Function  : 获取充电高温降电流限值结束温度
** @The notes : 充电高温2级(充电截止)为降充电电流限值终点
**===========================================================================================*/
s16 CalcGetChgCDnLstHTempHook(void);
/*=============================================================================================
** @Name      : s16 CalcGetDhgCDnFstHTempHook(void)
** @Input     : void
** @Output    : 放电高温降电流限值的起始温度 1℃
** @Function  : 获取放电高温降电流限值的起始温度
** @The notes : 默认45℃开始限放电电流限值
**===========================================================================================*/
s16 CalcGetDhgCDnFstHTempHook(void);
/*=============================================================================================
** @Name      : s16 CalcGetDhgCDnLstHTempHook(void)
** @Input     : void
** @Output    : 放电高温降电流限值结束温度 1℃
** @Function  : 获取放电高温降电流限值结束温度
** @The notes : 放电高温2级(放电截止)为降放电电流限值终点
**===========================================================================================*/
s16 CalcGetDhgCDnLstHTempHook(void);
/*=============================================================================================
** @Name      : u16 CalcGetDcSumSampVolt(u8 clunum)
** @Input     : clunum:
** @Output    : 电池组直流端总电压采样值(0.1V)
** @Function  : 获取电池组直流端总电压采样值
** @The notes : 根据采样方式
**===========================================================================================*/
u16 CalcGetDcSumSampVolt(u8 clunum);
/*=============================================================================================
** @Name      :u16 CalcGetDcPreSampVolt(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : 电池组直流端预充电压采样值(0.1V)
** @Function  : 获取电池组直流端预充电压采样值
** @The notes : 根据采样方式
**===========================================================================================*/
u16 CalcGetDcPreSampVolt(u8 clunum);
#endif