/*==========================================Copyright(c)=======================================
**                                  Shenzhen Infypower Co., Ltd.
**                                  Power conversion Department
**                                       BMS Product Line
**
**---------------------------------------File Information--------------------------------------
** @File Name    : CurrLimFall.h
** @Founder      : ZQD808
** @Date         : 2026.03.12
** @Function     : 充放电电流限值平滑模块
** @Instructions :
**===========================================================================================*/
#ifndef _CURRLIMFALL_H
#define _CURRLIMFALL_H
#include "BSPTypeDef.h"
/*=============================================================================================
** @Header file definition
**===========================================================================================*/

/*=============================================================================================
** @Macro definition
**===========================================================================================*/
#define	CHG_FIN_CV_CLR_OFFV     50     /*充电末端恒压调节复位电压回差(与恒压起始点电压回差) 1mv*/
#define	DHG_FIN_CV_CLR_OFFV     70     /*放电末端恒压调节复位电压回差(与恒压起始点电压回差) 1mv*/
/*=============================================================================================
** @Name      : void CurrLimFallTask(void)
** @Input     : void
** @Output    : void
** @Function  : 充放电电流限值平滑任务
** @The notes : 100ms
**===========================================================================================*/
void CurrLimFallTask(void);
/*=============================================================================================
** @Name      : void ResetCurrLimFallAPI(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : void
** @Function  : 复位充放电电流平滑限制
** @The notes : 平滑步骤清零
**===========================================================================================*/
void ResetCurrLimFallAPI(u8 clunum);
/*=============================================================================================
** @Name      : u8 GetFallChgCIndexStepAPI(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : 放电电流限值
** @Function  : 返回平滑降充电电流限值当前进度步骤
** @The notes : 当前降到第几个点
**===========================================================================================*/
u8 GetFallChgCIndexStepAPI(u8 clunum);
/*=============================================================================================
** @Name      : u8 GetFallDhgCIndexStepAPI(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : 放电电流限值
** @Function  : 返回平滑降放电电流限值当前进度步骤
** @The notes : 当前降到第几个点
**===========================================================================================*/
u8 GetFallDhgCIndexStepAPI(u8 clunum);
/*=============================================================================================
** @Name      : u16 GetFallChgLimCurr(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : 充电电流限值
** @Function  : 返回平滑计算的充电电流限值
** @The notes :
**===========================================================================================*/
u16 GetFallChgLimCurr(u8 clunum);
/*=============================================================================================
** @Name      : u16 GetFallDhgLimCurr(void)
** @Input     : clunum:簇编号
** @Output    : 放电电流限值
** @Function  : 返回平滑计算的放电电流限值
** @The notes :
**===========================================================================================*/
u16 GetFallDhgLimCurr(u8 clunum);
/*=============================================================================================
** @Name      : static void CVPIDCtrlChgCLim(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : void
** @Function  : PID调节充电电流控制电压稳定
** @The notes :
**===========================================================================================*/
static void CVPIDCtrlChgCLim(u8 clunum);
/*=============================================================================================
** @Name      : static void CVChgCurrLimPIDReset(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : void
** @Function  : 恒压方式平滑充电电流限值PID参数复位
** @The notes :
**===========================================================================================*/
static void CVChgCurrLimPIDReset(u8 clunum);
/*=============================================================================================
** @Name      : static u16 CVCalcChgPIDAimVolt(u8 index)
** @Input     : index:电流下标
** @Output    : PID目标电压:1mv
** @Function  : 计算恒压方式平滑充电电流限值PID目标电压
** @The notes : 从配置表查询
**===========================================================================================*/
static u16 CVCalcChgPIDAimVolt(u8 index);
/*=============================================================================================
** @Name      : static u16 CVCalcChgPIDAimCurr(u8 clunum, u8 index)
** @Input     : clunum:簇编号 index:电流下标
** @Output    : PID目标电流:0.1A
** @Function  : 计算恒压方式平滑充电电流限值PID目标电流
** @The notes : 从配置表查询
**===========================================================================================*/
static u16 CVCalcChgPIDAimCurr(u8 clunum, u8 index);
/*=============================================================================================
** @Name      : static void CVCalcDhgCLimDnStep(u8 clunum)
** @Input     : clunum:簇编号
** @Output    : void
** @Function  : 计算放电末端恒压放电电流限值下降步骤
** @The notes :
**===========================================================================================*/
static void CVCalcDhgCLimDnStep(u8 clunum);
/*=============================================================================================
** @Name      : static void CVDhgCurrLimStepDnReset(void)
** @Input     : void
** @Output    : void
** @Function  : 恒压方式平滑放电电流限值步长降流参数复位
** @The notes :
**===========================================================================================*/
static void CVDhgCurrLimStepDnReset(u8 clunum);
/*=============================================================================================
** @Name      : static u16 CVCalcDhgStepDnAimVolt(u8 index)
** @Input     : index:电流下标
** @Output    : 降流恒压目标电压:1mv
** @Function  : 计算恒压方式平滑放电电流限值降流恒压目标电压
** @The notes : 从配置表查询
**===========================================================================================*/
static u16 CVCalcDhgStepDnAimVolt(u8 index);
/*=============================================================================================
** @Name      : static u16 CVCalcDhgStepDnAimCurr(u8 clunum, u8 index)
** @Input     : clunum:簇编号 index:电流下标
** @Output    : PID目标电流:0.1A
** @Function  : 计算恒压方式平滑放电电流限值PID目标电流
** @The notes : 从配置表查询
**===========================================================================================*/
static u16 CVCalcDhgStepDnAimCurr(u8 clunum, u8 index);
#endif